init:
    $ mods["day_1"]= u"Лето с Женей"
    $ ya = Character(u'Я', color="FFFF00", what_color="E2C778", drop_shadow = [ (2, 2) ], drop_shadow_color = "#000", what_drop_shadow = [ (2, 2) ], what_drop_shadow_color = "#000")
    $ dev = Character(u'Девушка', color="FFFFFF", what_color="E2C778", drop_shadow = [ (2, 2) ], drop_shadow_color = "#000", what_drop_shadow = [ (2, 2) ], what_drop_shadow_color = "#000")
    $ met1 = False
    $ kniga = False
    $ prosmotr = False
    $ alis1 = False
    $ priz = False

label day_1:
    $ backdrop = "days" 
    $ new_chapter(0, u"День0.") 
    $ renpy.pause(2)
    $ prolog_time()
    play music music_list["door_to_nightmare"] fadein 2
    scene bg blur with dissolve
    show prologue_dream
    th "Кругом лишь пустота."
    "Как долго это продолжается?"
    "Я здесь уже так давно, что знакомые образы стерлись из воспоминаний."
    "Родной двор, улицы, по которым я когда-то ходил, являлись ко мне во снах темными, размытыми пятнами."
    "Абсолютно чужими и зловещими."
    "От них не веяло теплом и уютом, лишь тревога пробирала до дрожи."
    "А если я уже умер и господь наказывает меня за грехи? За то, что не верил в него?"
    "Иначе, как объяснить происходящее..." 
    "Каждую ночь я мучался от жутких кошмаров."
    "Неведомый ужас, смотрящий на меня из темных уголков души. Вырывающийся наружу всякий раз, стоило лишь заркрыть глаза."
    "С каждым днем я помню все меньше о собственной жизни."
    "Однажды проснусь и не узнаю себя в зеркале."
    "Может, вообще перестану существовать." 
    scene bg garblur
    show prologue_dream
    "В голове все еще оставалось многое о том времени."
    "Воспоминания о детстве и юности, имена родителей и друзей. Даже нашего бессменного президента. Его забудешь, как же..."
    "Но я чувствовал, что с каждым новым витком какая-то мелочь пропадает."
    "Незначительная вещь вроде клички соседского пса или один случайный день из длинной череды одинаковых, бездарно прожитых лет."
    "Сначала это было незаметно. Не казалось чем-то подозрительным."
    "В конце концов, я не был удивлен тому, что после всего случившегося я вообще сохранил здравый рассудок, не говоря уже о целостной памяти."
    "Спустя несколько витков я обнаружил, что многие вещи перемешались, целые куски моей биографии просто исчезли."
    "Я не мог отличить настоящие события, которые случились наяву, от иных, замененных."
    "Я просыпался другим человеком, истерзанным экзистенциальным страхом."
    scene bg lift
    show prologue_dream
    "Но так было не всегда..."
    "В прошлом это место было уголком моего счастья. От мысли об этом становилось лишь еще больнее."
    "Будто тому, кто отправил меня сюда, показалось, что я слишком мало страдал в прошлой жизни и он решил наполнить мое сердце надеждой, а потом разбить его на мелкие кусочки."
    scene bg darksov
    show prologue_dream
    show pi close with dspr
    pi "Ты должен найти дорогу, пока не поздно."
    ya "Что же ты сам до сих пор здесь? Не нашел выхода? С чего ты решил, что он вообще есть?"
    pi "Я потратил драгоценное время. Но у тебя еще есть шанс."
    ya "Да заткнись ты! Ты вообще не существуешь! Лишь голос в моей голове!"
    pi "А ты уверен, что сам еще существуешь? Не стал одной из тех безвольных кукол?"
    ya "Не знаю..."
    pi "Хочешь и дальше тянуть время? Убиваться по ней? Мы же оба знаем эту историю."
    ya "Это все, что у меня осталось. Последнее яркое воспоминание в поглотившей мой разум тьме."
    pi "Я ошибся в тебе. Ты такой же как и остальные. Безвольная кукла. Будь в тебе хоть доля смелости, ты бы смог уйти."
    ya "Пошел ты!" 
    hide pi close with dspr
    stop music fadeout 2
    "Навязчивый собеседник в тот же момент исчез, оставив меня среди мрачных теней."
    "Воспоминания нахлынули волной, пробирая болью до самого сердца."
    show black with dissolve
    hide prologue_dream with dissolve
    $ renpy.pause (1, hard = True)
    jump label_day_2