label label_day_2:
    $ persistent.sprite_time = "day"
    $ backdrop = "days" 
    $ new_chapter(1, u"Лето с Женей: День 1") 
    $ renpy.pause(2)
    $ renpy.block_rollback()

    play music music_list["everyday_theme"] fadein 2
    scene bg ext_bus with dissolve2
    "Странно..."
    "Не могу вспомнить куда я ехал и даже откуда."
    "В моем возрасте еще рано страдать провалами в памяти, сотрясений не имел, проблем с головой тоже серьезных не наблюдалось."
    "Я осмотрел автобус, но ничего странного не обнаружил, как бы придирчиво не смотрел."
    "Никаких маршрутов, остановок или даже номера так и не смог обнаружить." 
    "Судя по всему частный или вовсе заказной, но куда я мог на нем ехать?"
    "Уже много лет я выбирался из дома лишь по неотложным делам, стараясь не покидать квартиры без крайней нужды."
    "Как там у Бродского было? {i}Не выходи из комнаты, не совершай ошибку{/i}."
    "Что ж... Похоже, я пренебрег этим принципом и оказался черт знает где."
    "Зная свою внимательность, вполне мог сесть на неправильный маршрут и таким чудесным образом уехать в пригород." 
    scene bg int_bus with dissolve2
    "Я заглянул в салон."
    "Ни пассажиров, ни водителя не было. Вокруг автобуса тоже ни единой живой души."
    "Очевидно, автобус заказной."
    "Водитель закончил рабочий день и сегодня машина уже никуда не тронется."
    "Странное место для конечной."
    scene bg ext_road_day with dissolve2
    "Я выбрался наружу и немного прошелся вдоль дороги."
    "Города даже на горизонте не видно."
    "Длинное, извилистое дорожное полотно уходило далеко в бесконечность."
    "Вот это я попал, конечно. И что теперь делать?"
    scene bg ext_camp_entrance_day with dissolve2
    "Я вернулся обратно в поисках хоть кого-то, кто объяснит мне где я нахожусь."
    "Пройдя мимо автобусной стоянки, я уткнулся в железные ворота с надписью {b}Совенок.{/b}"
    "Надо же. Лагеря до сих пор существуют, а этот еще и пионерский. Местные алкаши, кажется, еще не растащили на металл совковое наследие."
    "Ворота приоткрылись и мне навстречу вышла светоловолосая молодая девушка с приятной внешностью и улыбкой, выражающей искреннее дружелюбие."
    show sl happy pioneer far at right with dissolve2
    sl "Привет, ты новенький? Меня Славя зовут."
    "И что это за карнавал такой? Маловата она для ретро фестивалей на природе."
    ya "Наверное, это какая-то ошибка. Я не должен был тут оказаться."
    sl "Никакой ошибки быть не может. Пойдем, я провожу тебя к вожатой." 
    "Она говорила уверенно, точно зная, что делает."
    ya "Я повторяю, произошла ошибка, мне в город надо."
    show sl serious pioneer far at right with dissolve
    sl "Зачем?" 
    "Славя застыла в недоумении, подозрительно разглядывая меня."

    menu:
        "Ответить вежливо":
            ya "Потому что я там живу."
            show sl happy pioneer far at right with dissolve2
            sl "Расскажешь обо всех проблемах Ольге Дмитриевне, я провожу тебя."

        "Ответить грубо":
            ya "Ты дура или прикидываешься?"   
            show sl sad pioneer far with dissolve
            sl "Не стыдно такие слова девочке говорить? А еще пионер. Немедленно пошли к Ольге Дмитриевне! Она решит как с тобой поступить."
            "Блондинка, кажется, сильно расстроилась после моих слов."

    "Мне ничего не оставалось, кроме как последовать за ней в поисках ответов."
    stop music fadeout 2
    scene bg ext_square_day with dissolve2
    play ambience ambience_day_countryside_ambience
    show sl smile pioneer far at right
    show dv rage pioneer far at left
    with dissolve
    dev "Чего вылупился? Дай пройти!"
    hide dv rage pioneer close at left with dissolve
    play sound sfx_punch_medium
    "Рыжеволосая грубо толкнула меня и быстро скрылась за ближайшими постройками." with vpunch
    "Славя не обратила на эту сумасшедшую особого внимания."
    "Совсем обнаглела, молодежь." 
    "Женщин бить не принято, вот они и наглеют. Зря, конечно, что нельзя. Иногда прямо хочется."
    "Особенно таких бескультурных."
    sl "Не отставай, мы почти пришли."
    "Я ничего ей не ответил, лишь молча шел следом. Заблудиться два раза за день было бы совсем нелепо."
    scene bg ext_houses_day with dissolve
    show sl smile pioneer close at left with dissolve
    "Мы подошли к жилым домикам. Это действительно лагерь, крайне похожий на старые советские пионерлагеря. Создатели постарались. Очень похоже."
    sl "А вот и Ольга Дмитриевна."
    "Блондинка взглянула на светловолосую женщину не страше тридцати, которая, завидев нас, пошла навстречу." 
    show mt smile pioneer close at right with dissolve
    mt "Наконец-то приехал. Мы уж заждались тебя, пионер."
    "Чегооо, бл..."
    ya "В каком смысле ''заждались''?"
    mt "В самом обычном, с утра тебя ожидаем."
    "Так, я тут не случайно? Хм..."
    ya "Я вообще-то не тут должен..."
    mt "Все вопросы потом, сначала вещи сложи, а потом марш на обед. Завтрак ты уже пропустил. И поторопись, если не хочешь до вечера голодным проходить."
    "Да как она смеет? Я ей мальчик какой-то?"
    ya "Ольга, как вас там... Дмитриевна. А что тут собственно проис..."
    show mt angry pioneer close at right
    mt "Какой непослушный пионер! Я тебе что сказала? Вещи в домик сложил и на обед, будет еще время, наговоришься. Славя тебя проводит."
    "К черту спорить с этой своевольной женщиной. К тому же, я действительно голодный, а неизвестно сколько придется проторчать в этом жутком месте."
    play sound sfx_open_door_1
    scene bg dom with dissolve2
    show sl normal pioneer close at center with dissolve
    stop ambience
    sl "Вот и твое жилище. Располагайся. Пока у тебя нет соседа, но ты не скучай. Ребята всегда где-то рядом."
    "Славя указала на мою кровать."
    sl "Я тебя на улице подожду."
    hide sl smile pioneer close at left with dissolve
    "На самом деле даже хорошо, что рядом никого не будет. Меньше опасности, да и не любитель я общих комнат. Предпочитаю уединение."
    "Интерьер довольно простенький. Ничего лишнего: пара кроватей, стол, стулья и тумобчка для личных вещей. Еще несколько настенных полок, но это не столь необходимо."
    "Я сложил верхнюю одежду в тумбочку, вытащив из куртки мобильник, сунул в брючный карман."
    "Внезапно для себя я обнаружил, что одет в точно такую же пионерскую форму, как и остальные."
    "Нет, ну это уже совсем мистика какая-то. Да и что с телом моим? Будто моложе лет на восемь стал." 
    "Может быть это сон или того хуже... Я умер?"
    "Это многое бы объяснило. Например то, что я не помню как оказался в автобусе. Наверное, сознание стерло последнее страшное воспоминание в моей жизни."
    "Либо это чья-то очень хитрая шутка." 
    "Что же, рано паниковать, надо искать ответы." 
    "Нет, я точно живой. Мертвым неведом голод, а у меня от него аж живот урчать начинает."
    "Пообедаю и начну разбираться."


    play ambience ambience_day_countryside_ambience fadein 2
    scene bg ext_dining_hall_away_day
    show sl normal pioneer close at center 
    with dissolve
    sl "Голодный небось, пионер?"
    ya "Немного."
    "На самом деле я бы целого быка сейчас сожрал."
    sl "Пойдем, заодно познакомлю тебя с остальными наконец. И пожалуйста, веди себя прилично. Не хочу из-за вас жалобы Ольги Дмитриевны слушать."
    "Последнего я обещать не мог. С другой стороны, особенно выпендриваться тоже не стоило. Мало ли как все обернется в совершенно незнакомой мне обстановке."
    scene bg ext_dining_hall_near_day
    show sl normal pioneer close at center with dissolve
    show un normal pioneer close at left with dissolve
    sl "Привет Лена."
    "Славя поздоровалась с проходящей мимо девочкой, с милыми хвостиками и задумчивым взглядом. Она тоже шла на обед."
    un "Здравствуйте."
    "Смущенно поприветствовала нас Лена и поспешила в столовую." 
    hide un normal pioneer close at left with dissolve
    "У крыльца стояли двое парней."
    show sl normal pioneer far at right with dissolve
    show el normal pioneer far at left
    show sh normal_smile pioneer far at center
    "А то мне начало казаться, что тут одни девки." 
    sl "А это наши мальчики из кружка кибернетики. Электроник и Шурик."
    "Представила их Славя."
    el "Привет Славя. Кто это с тобой?"
    sl "Новенький, только сегодня приехал. Вот, показываю ему лагерь."
    sh "Отличное пополнение к нашему клубу."
    sl "Вы чего тут стоите? Обед остывает, бегом к столу."
    "Парни мигом заскочили в приоткрытую дверь." 
    hide el normal pioneer far at left
    hide sh normal_smile pioneer far at center
    with dissolve
    sl "Какие же они все таки недисциплинированные. Хоть на веревочке за собой води."
    "Славя вздохнула от отчаяния."
    ya "На вид придурки какие-то." 
    dv "Лучше и не скажешь."
    "Сзади появилась та рыжеволосая."
    show dv normal pioneer2 close at left with dissolve
    show sl serious pioneer far at right with dissolve
    sl "Алиса, и ты здесь. Так вот, скажу вам обоим. Не смей никого обижать. Я Ольге Дмитриевне расскажу, она на тебя быстро управу найдет."
    dv "Мы так... Шутим. Иди, подруга. Нам с новеньким поговорить надо."
    show sl normal pioneer far at right with dissolve
    sl "Ладно, не опоздайте на прием пищи."
    hide sl normal pioneer far at center with dissolve
    show dv smile pioneer2 close at left
    dv "А ты не так плох. Прости уж за ту ситуацию на площади. Ходят тут всякие."
    ya "Забыли, не обижаюсь."
    ya "Это все обитатели лагеря?"
    dv "Конечно нет. Еще есть Ульяна, маленькая заноза в..."
    ya "Я понял где."
    dv "Помимо нее есть Мику, веселая девчонка, хоть и слегка не в себе. А еще Женя - заведующая библиотекой. Вот с ней точно связываться не советую."
    ya "Почему?"
    dv "Сам скоро узнаешь."
    show dv smile pioneer2 close at left
    "Алиса хитро улыбнулась."
    dv "Я тебя предупредила, не скучай, пионер."
    stop ambience fadeout 1

    play ambience ambience_dining_hall_full fadein 1
    scene bg int_dining_hall_people_day with dissolve
    "В столовой было полно народу."
    "Не помню такого зрелища со времен школы, когда мы так же стояли с подносами в очереди, дабы отведать безвкусной каши на воде и блевотного какао."
    show cg d1_food_normal with dissolve
    "Но здешняя еда меня удивила. Она пахла и выглядела как еда, не как куча слипшихся вялых червей."
    "Я быстро опустошил тарелки, залпом выпил сладкий кисель и немного расслабился."
    hide cg d1_food_normal with dissolve
    "Как только отвяжусь от навязчивых пионеров, нужно будет сходить на разведку. Может тут ходит какой-то транспорт или смогу добраться до деревни и попросить помощи."
    "От пионеров этих фиг дождешься. Странные они."
    show mi normal pioneer close at left with dissolve
    mi "Привет, я Мику."
    "Девушка появилась так внезапно."
    "Ее звонкий голос заставил меня вздрогнуть от неожиданности."
    ya "Привет."
    mi "Ты тот самый новенький? Буду рада, если вступишь в наш музыкальный клуб. Да, кстати, я рукводитель музыкального клуба нашего лагеря."
    mi "Пока я там одна, но если ты вступишь, нас будет уже двое. Вместе же веселее, правда?"
    mi "Подумай, я буду рада новым участникам."
    "Она говорила так быстро, что я едва успевал понимать ее речь."
    "Девочка слишком гиперактивная, а то и под веществами."
    "Теперь понимаю о чем говорила Алиса."
    ya "Подумаю."
    show mi happy pioneer close at left
    mi "Вот и отлично, заглядывай в клуб, увидимся."
    hide mi with dissolve
    "Сумасшедшая девчонка вприпрыжку убежала на улицу."

    show black with dissolve
    stop ambience fadeout 1
    $ renpy.pause (1, hard = True)
    play ambience ambience_ext_road_evening fadein 1
    scene bg ext_square_sunset
    hide black 
    with dissolve

    "Дождавшись удачного момента, я увильнул от пристального взгляда Слави и вернулся на площадь."
    show dv normal pioneer2 close at left with dissolve
    "На площади я пересекся с Алисой."
    "Она несла в руках какой-то бумажный сверток."
    ya "Стащила что-то из столовой?"
    show dv sad pioneer2 close
    dv "Чего шумишь на всю улицу!"
    dv "Да, взяла парочку булок лишних, ну а что такого?"
    ya "Кому-то не достанется теперь."
    dv "Не надо из меня жалость давить. Это их проблемы."
    show dv shy pioneer2 close
    dv "Слушай, не выдавай меня, а?"
    ya "Какие проблемы. Не выдам."
    hide dv with dissolve
    "Не до чужих разборок мне сейчас было."
    "Пока не стемнело, надо осмотреться."
    "Вопрос в том, куда пойти."
    $ disable_all_zones()
    $ set_zone("beach","beach_1")
    $ set_zone("forest","forest_1")
    $ set_zone("boat_station","boat_1")
    $ show_map()

label beach_1:
    stop ambience fadeout 2
    play ambience ambience_lake_shore_evening fadein 1
    scene bg ext_beach_sunset with dissolve
    "Самый обыкновенный пляж. Дети резвятся. Крики, брызги воды. Типичная картина."
    "И зачем я пришел?"
    "Это никак не приближает меня к цели."
    play sound sfx_punch_medium
    with hpunch
    "В меня с разбега врезалась девочка."
    show us smile swim close at left with dissolve
    us "Ты чего встал посреди дороги? Не видишь, пионеры отдыхают."
    "Судя по всему, та маленькая зараза из рассказов Алисы."
    ya "Брысь отсюда, малышня."
    show us angry swim close at left
    us "Это я малышня? Да я не сильно моложе тебя!"
    ya "Тебе русским языком сказано, пошла вон, пока в реке не утопил!"
    us "Бее, злодей."
    hide us with dissolve
    "Девочка показала мне язык и убежала к воде."
    "Мне тоже не было причин оставаться."
    "С этой стороны я точно не выберусь из лагеря."
    "Стоит вернуться и проверить другие направления."
    "Может, даже найти транспорт."
    $ met1 = True
    $ disable_all_zones()
    $ set_zone("forest","forest_1")
    $ set_zone("boat_station","boat_1")
    $ show_map()

label forest_1:
    stop ambience fadeout 2
    play ambience ambience_forest_evening fadein 1
    scene bg les with dissolve
    "Я шел вперед по лесной тропнике, уже прилично отдалившись от лагеря."
    show pi far at right with dissolve
    $ renpy.pause(0.2)
    hide pi with dissolve
    "Кто это там был? Показалось, наверное."
    scene bg ext_polyana_sunset with dissolve
    "Я продолжал идти, пока не добрался до небольшой поляны."
    if met1 == True:
        "Там, уютно расположившись в тени большого дерева, сидела девушка с книгой."
        "Она не обращала на меня внимания, пока я не решил подойти ближе."
        show zh bukal glasses pioneer far at left with dissolve
        dev "Что смотришь? Пионеров отдыхающих никогда не видел? Так иди в лагерь глазей, их там полно."
        "Она выглядела довольно сердитой."
        ya "Да так, ничего особенного."
        dev "Нигде покоя нет, в лес уйдешь книжку почитать, так и здесь достанут."
        "Кажется, остальная тусовка ей не по душе. Очень понимаю."
        menu:
            "Спросить про книгу":
                ya "Что читаешь?"
                show zh bukal glasses pioneer close at left with dspr
                dev "Книгу."
                dev "Что тебе надо от меня?"
                ya "Чего такая сердитая?"
                show zh angry glasses pioneer close at left
                dev "Потому что ты задаешь глупые вопросы."
                "Дама явно не была настроена на диалог."
                "Стоило оставить ее в покое."
                ya "Слушай, я просто пройду мимо. Ладно?"
                dev "Тогда и я пройду."
                hide zh with dissolve
                "Она ушла, не дожидаясь моего ответа, недовольно бормоча себе под нос."
                "Что же, я бы тоже не обрадовался вторжению в личное пространство."
                "У некоторых людей оно бывает слишком обширно."
                "Я решил хорошенько осмотреться."
                "Забрался на дерево, так высоко, насколько мне хватило ловкости."
                "К сожалению, даже с высоты, я мог разглядеть лишь бесконечные кроны деревьев."
                "Никаких дорог и деревень поблизости, а идти по лесу вслепую - явно не лучшая идея."
                "Да и скоро окончательно стемнеет. Придется отложить поиски до завтрашнего дня."

            "Промолчать":
                show zh angry glasses pioneer close at left
                dev "Раз у тебя нет ко мне никаких дел, пойду туда, где никто не будет доставать меня своим навязчивым вниманием."
                hide zh with dissolve
                "Недовольная девушка поспешила уйти в сторону лагеря."
                "Что же, я бы тоже не обрадовался вторжению в личное пространство, которе у некоторых людей достаточно обширно."
                "Я решил хорошенько осмотреться."
                "Забрался на дерево, так высоко, насколько мне хватило ловкости."
                "К сожалению, даже с высоты, я мог разглядеть лишь бесконечные кроны деревьев."
                "Никаких дорог и деревень поблизости, а идти по лесу вслепую - явно не лучшая идея."
                "Да и скоро окончательно стемнеет. Придется отложить поиски до завтрашнего дня."
    else:
        "Трава под деревом была заметно примята. Вероятно, кто-то из пионеров здесь недавно был, но мы с ним разминулись."
        "Я решил хорошенько осмотреться."
        "Забрался на дерево, так высоко, насколько мне хватило ловкости." 
        "К сожалению, даже с высоты, я мог разглядеть лишь бесконечные кроны деревьев."
        "Никаких дорог или деревень поблизости, а идти по лесу вслепую - явно не лучшая идея."
        "Да и скоро окончательно стемнеет. Придется отложить поиски до завтрашнего дня."
    stop ambience fadeout 1
    jump day_1_1

label boat_1:
    stop ambience fadeout 2

    play ambience ambience_lake_shore_evening fadein 1
    scene bg ext_boathouse_day with dissolve
    "Это был очевидно ложный маршрут."
    "Если только я не собираюсь бежать по воде на соседний берег, в чем не было никакого смысла."
    "Украсть лодку и поплыть в неизвестность?"
    "Нет, я еще не настолько отчаялся."
    "Впрочем, я не смог отказать себе в удовольствии передохнуть после плотного обеда."
    "Какое-то время я просидел на причале, смотря как поодаль на пляже веселятся дети."
    stop ambience fadeout 1
    jump day_1_1

label day_1_1:
    play ambience ambience_ext_road_evening fadein 1
    scene bg ext_square_sunset with dissolve
    $ persistent.sprite_time = "sunset"
    "Я вернулся на площадь, где меня уже ждала вожатая с крайне серьезным видом."
    show mt angry panama pioneer far at center with dissolve
    mt "Вот ты где!"
    mt "Ты почему из столовой сбежал? Славя тебя обыскалась."
    show mt rage panama pioneer close at center
    mt "Мало на мою голову Алисы, так теперь еще и ты хулиганить вздумал."
    mt "Я твоим родителям позвоню, все расскажу о твоем поведении!"
    "Да, позвони, посмотрим, что они тебе скажут."
    mt "Собирайся на ужин, хотя, за такое поведение следовало бы оставить тебя голодным."
    mt "А после в свой домик. И это не обсуждается. Устали мы за тобой бегать. И только попробуй завтра не явиться на утренее построение."
    "Черт, точно! У меня же все это время был телефон."
    hide mt with dissolve
    "Дождавшись, пока вожатая закончит свои речи, я отошел в сторонку и вытащил телефон из кармана."
    play sound sfx_cellular_phone_error
    "Только вот ни интернета, ни даже связи не было." 
    "Что же это за глушь такая?"
    "И самое главное, сколько мне еще придется тут торчать?"
    "Логика вообще отказывалась работать. Столько странных вещей, я же не мог реально помолодеть и оказаться в прошлом?"
    "Путешествия в прошлое физически невозможны. Может, это какая-то альтернативная временная линия?"
    "А насколько я могу судить, параллельный мир может как быть идентичным, так и сильно отличаться."
    "Стоило наведаться в местную библиотеку и узнать наверняка. Найти несостыковки в исторических событиях."
    "Но уже не сегодня."

    show black with dissolve
    stop ambience fadeout 1
    $ renpy.pause (1, hard = True)
    play ambience ambience_dining_hall_full fadein 1
    scene bg int_dining_hall_with_people_sunset with dissolve
    hide black 
    with dissolve

    "Я старался не привлекать лишнего внимания, тихо ужиная за крайним столиком у окна."
    "Здешние обитатели какие-то слишком подозрительные."
    "Славя - настоящий пионер с плаката."
    "Активная, исполнительная, ответственная. Гражданин без изъянов. Новый советский человек."
    "Ха-ха."
    "Алиса вроде бы ничего. Но и к ней есть вопросы."
    "Надолго я бы с ней не остался."
    "Она прямо жаждет неприятностей и непременно находит их."
    "Хоть она и нравилась мне, но лучше с ней не связываться."
    "Лишнее внимание привлекать ой как не хотелось, а с ней это обеспечено."
    "Остальных я и видел разве что мельком. Пусть так и остается."
    "Я доел свою еду и отправился к себе в домик."

    show black with dissolve
    stop ambience fadeout 1
    $ renpy.pause (1, hard = True)
    play sound sfx_open_door_1
    scene bg dom
    hide black 
    with dissolve

    "А зарядки у меня и нет. Телефон через пару дней будет не полезнее камня, да и сейчас толку от него маловато."
    "Только фонариком куда посветить или музыку послушать, пока батарея не села." 
    "И где времена, когда телефоны держали заряд месяцами, а не вырубались через пару дней от редкого просмотра времени с экрана."
    "Такие технологии, сорок лет технического прогресса, а стоило попасть в прошлое и от этих технологий никакого прока."
    "Я с печалью в душе осмотрел пустую комнату и лег на кровать."
    "Завтра трудный день, надо набраться сил."
    show blink
    $renpy.pause (2)
    jump label_day_3