label label_day_7:
    $ persistent.sprite_time = "day"
    $ backdrop = "days" 
    $ new_chapter(6, u"Лето с Женей: День 6") 
    $ renpy.pause(2)
    $ renpy.block_rollback()

    play music music_list["memories"] fadein 2
    scene bg dom with dissolve
    "Дежавю какое-то."
    "Я уже был здесь."
    "Нет, не в том смысле, что я был тут вчера, это и так понятно."
    "Я был тут."
    "В этом лагере."
    "Когда и как?"
    "В детстве?"
    "Нет, это невозможно."
    "Не совпадало время и место, я вообще по лагерям никогда не любил ездить."
    "Странное ощущение, будто бы я уже был в этом лагере когда-то, хотя и не мог вспомнить ничего об этом."
    "Абстрактная ностальгия, которая бывает, когда возвращаешься куда-то где не был много лет."
    "Снова эффект переноса, не иначе."
    "Судя по обстановке - восьмидесятые, позже уже быть не может, а для более ранних лет слишком все тут современно."
    "Добавь сюда какой-нибудь современной техники и покрась ворота и не отличишь от моего времени."
    "Готов поспорить, что через сорок лет все будет выглядеть так же, если не сгниет или не попилят на металл."
    "Нет, я определенно не мог быть здесь в детстве."
    "Я родился уже после того, как красная империя рухнула и все свои поездки в летние лагеря прекрасно помнил."
    "Ни одна из них не была похожа на все вокруг."
    "Как бы я не прогонял эти мысли, мозг упрямо требовал логичных ответов."
    "Почему я здесь? Что происходит? Как это возможно?"
    "Кто тот загадочный пионер и что ему надо?"
    "Такой же заблудившийся во времени, как я?"
    "Или тот, кто все это и устроил?"
    "А может..."
    "Разум вполне можно обмануть, с телом сложнее."
    "Все эти неслучайные совпадения и ситуации в которых я оказывался."
    "Почти всегда я знал что делать."
    "Даже не так."
    "Конечности сами рефлекторно тянулись в нужном направлении, а я лишь помогал им командами мозга."
    "Сколько времени на самом деле прошло между настоящей жизнью и этим проклятым автобусом?"
    show mt normal pioneer close at center with dspr
    play sound sfx_open_door_1
    mt "Ты еще и не просыпался."
    mt "Я вовсе не удивлена этому."
    ya "Я еще не успел ничего натворить за сегодня."
    mt "А на часы-то смотрел?"
    mt "Время уже к полудню, а ты только проснулся. Линейку проспал, завтрак тоже пропустил."
    ya "Как-то устал вчера."
    show mt angry pioneer close at center with dspr
    mt "Знаю я отчего ты устал, пионер. Видели тебя ночами блуждающим по лагерю."
    ya "Время летит быстро, не уследил."
    show mt normal pioneer close at center with dspr
    mt "Даже не начинай, плохо получается врать."
    ya "Спасибо, я едва не начал путаться в показаниях."
    mt "Ох, и свалился же ты на мою голову, пионер."
    mt "Нет бы прилежно выполнять обязанности, но надо же везде натворить дел всяких, еще и на вожатую огрызаешься."
    ya "И в мыслях не было."
    "Было."
    mt "Ладно, жалею я вас, хулиганов." 
    mt "Хватит в в постели валяться, выспался уже."
    mt "В следующий раз хорошо подумаешь, прежде чем лагерный режим нарушать."
    hide mt with dissolve
    play sound sfx_open_door_1
    "Я неохотно поднялся с кровати, потягиваясь и зевая."
    "Рука машинально потянулась за телефоном."
    "Ах да!"
    "Ничего же не работает."
    play ambience ambience_ext_road_day fadein 1
    stop music fadeout 2
    scene bg ext_houses_day with dissolve
    "В глаза ударил яркий дневной свет."
    "Начинаю узнавать привычного себя."
    "Сначала спишь до полудня, потом до самого вечера и в конечном итоге начинаешь просыпаться где-то среди ночи, теряя ориентацию в днях недели."
    "Еще и голова квадратная."
    "Но что-то я опять о печальном."
    "Стоит наведаться в библиотеку."
    "Женя наверняка ждет меня."
    "По крайней мере, мысли об этом заставляли мое сердце биться чаще."
    "Только вот Алиса во всей этой истории могла нарушить наш хрупкий мир."
    "От нее можно было ожидать чего угодно."
    "Зная ее, трудно представить какие козни она была способно подстроить."
    "Надеяться на ее благоразумие не приходилось."
    "А это значит, что мне стоит с этим разобраться, желательно, не прибегая к помощи Жени."
    "Эти двое со вчерашнего утра косо друг на друга смотрели, а что началось к вечеру и подумать страшно, не будь меня рядом."
    "Надо навестить Алису."
    scene bg ext_house_of_dv_day with dissolve
    "Очевидно, в домике ее не было."
    "А что ей тут делать среди дня?"
    "Пойти искать самому или спросить у девочек?"
    "Хм..."

    menu:
        "Искать самому":
            "Ну уж нет."
            "Попробую найти ее сам."
            scene bg ext_square_day with dissolve
            show un normal pioneer far at right with dissolve
            "На площади я едва не столкнулся с Леной, но мы молчаливо разминулись."
            hide un with dissolve
            "Вот и хорошо."
            "Тем более совсем не хотелось попадаться Лене на глаза после той нелепой сцены у медпункта."
            "Надеюсь, ее не сильно ругали из-за пропажи."
            "Cпрашивать я не рискнул."
            jump day_6_1_1

        "Спросить про Алису у девочек":
            "Она могла пойти куда угодно."
            "Надо спросить у девочек."
            "Может быть, они видели куда пошла Алиса."
            stop ambience fadeout 1
            play ambience ambience_lake_shore_day fadein 1
            scene bg ext_beach_day with dissolve
            show sl normal swim close at center with dissolve
            sl "О, привет."
            ya "И тебе добрый день."
            sl "Снова Женю ищешь? Она в библиотеке, наверное."
            sl "Женя сильно изменилась за эти дни."
            show sl smile swim close at center with dspr
            sl "Похоже, ты к этому причастен."
            ya "Надеюсь, перемены были к лучшему."
            sl "Она все так же ругается, если отвлекать ее по пустякам, но когда остается одна, я вижу ее мечтательный взгляд."
            ya "Рад за нее."
            ya "Только я по другому поводу."
            ya "Мне нужно поговорить с Алисой, не видела ее?"
            sl "На площадке была с Ульяной вроде бы."
            ya "Спасибо, отправлюсь туда."
            jump day_6_1_2

label day_6_1_1:

    "Вообще, если так подумать..."
    "Стоит предупредить Женю о своих намерениях."
    "Не хватало каких-то нелепых сцен еще, хотя идти в библиотеку - только время тратить."
    "Уверен, что я быстро со всем разберусь и мне не придется отвлекаться на это потом."
    "Может, Ульяна видела Алису?"
    "Наверняка, мелкая опять на площадке беснуется."
    jump day_6_1_2

label day_6_1_2:

    stop ambience fadeout 1
    scene bg ext_playground_day with dissolve
    play ambience ambience_soccer_play_background fadein 1
    "Ульяна и Алиса играли на площадке в футбол."
    "Похоже, рыжая уже не опечалена прошедшим вечером."
    "Выглядит вполне жизнерадостно."
    "Но поговорить стоило."
    "На всякий случай."
    show us smile sport close at left with dissolve
    show dv normal pioneer2 close at right with dissolve
    us "Надо же, какие люди, и без охраны."
    us "Поиграть с нами пришел?"
    ya "Еще чего, делать мне больше нечего."
    ya "Я к Алисе пришел. Поговорить надо."
    ya "Без лишних ушей."
    "Я сделал грозное выражение лица и посмотрела на Ульяну."
    show us normal sport close at left with dissolve
    us "Ладно, ухожу."
    hide us with dissolve
    dv "Зачем пришел? Вчера все выяснили."
    ya "Себе-то хоть не ври."
    ya "Я знаю каково это и не могу все так оставить."
    show dv sad pioneer2 close with dspr
    dv "Что тебе от меня надо? Погулять не с кем? Иди к Жене у вас все отлично выходит."
    ya "Пошли прогуляемся, нам стоит обсудить случившееся."
    dv "С чего ты решил, что я с тобой куда-то пойду? Я не твоя подружка из библиотеки."
    "Как же с вами все сложно."
    ya "Ладно, я пойду один, но хотел бы, чтобы ты тоже пошла."
    "Я отошел от игровой площадки подальше."
    "Уловка сработала, едва я отдалился на десяток шагов, Алиса отправилась следом."
    "Можно было взять ее за руку и утащить силой, но я не был уверен что с Алисой это сработает, а по лицу получить не хотелось."
    "Хорошо, что все так удачно сложилось."
    stop ambience fadeout 1
    play ambience ambience_ext_road_day fadein 1
    scene bg ext_no_bus
    show dv normal pioneer2 close at center
    with dissolve
    dv "Ну и зачем приташил меня сюда? Что еще сказать хотел?"
    ya "После вчерашнего вечера я чувствую себя виноватым."
    dv "Неужели?"
    ya "Мы отлично подружились за эти дни, но кажется, все стало идти куда-то еще."
    ya "Ты интересная, красивая и все такое..."
    ya "Но так вышло, что я не твой человек."
    show dv sad pioneer2 close
    dv "И зачем ты все это говоришь мне? Я вчера поняла, что не нужна тебе."
    ya "Не будь ты важна для меня, я не стал бы все это сейчас говорить."
    dv "Ну чем она лучше меня? Коротышка без фигуры, вредная и скучная."
    ya "И чем-то она меня зацепила. Есть вещи неподвластные логике, это просто чувства."
    ya "Ты обязательно найдешь кого-то, кто оценит и примет тебя такой, какая ты есть."
    dv "Мне всегда так говорили, извини, Алиса, но тебе снова нет места среди нас."
    dv "Алиса, у нас другие порядки ты нам не подходишь."
    dv "Даже когда удалось найти кого-то, кто понимает меня, все кончается вот так."
    show dv cry pioneer2 close with dspr
    "Алиса залилась слезами."
    ya "Послушай меня, пожалуйста."
    ya "Мир жесток, ужаснен и полон страданий."
    ya "Многие люди захотят тебя предать или обмануть, обидеть и сделать больно."
    ya "Я не хочу быть одним из них. Хочу чтобы ты знала."
    ya "Ты прекрасна в своей уникальности, таких как ты больше нет, и я желаю тебе просто быть собой."
    ya "Не слушай никого, будь собой и цени себя настоящую. Однажды ты встретишь того, кто полюбит тебя такую."
    ya "Ты правда очень понравилась мне, если бы все сложилось иначе или я был бы другим человеком, мы обязательно были бы вместе, но все оказалось сложнее."
    show dv normal pioneer2 close with dspr
    dv "Так значит, если бы Жени не было..."
    ya "Не знаю, что ты там задумала, но даже не начинай."
    dv "Ладно, пусть живет."
    ya "Надеюсь, ты это не серьезно."
    dv "Надейся."
    show dv smile pioneer2 close with dspr
    "Алиса сказала это с какой-то недоброй ноткой в голосе."
    ya "Времени уже много, на обед пора."
    dv "Пойдем."
    scene bg ext_houses_day with dissolve
    show dv normal pioneer2 close at right with dissolve
    dv "Подожди."
    ya "Ну чего еще?"

    scene bg poslal with dspr
    $ renpy.pause (4, hard = True)
    scene bg ext_houses_day with dissolve
    show dv smile pioneer2 close at right with dissolve

    "От неожиданности я даже не понял что произошло."
    "Вот как Женя себя чувствовала в тот раз..."
    ya "Ты что делаешь?!"
    dv "Хотела попробовать как это. Хотя бы раз."
    dv "Понравилось?"
    dv "Явно же получше, чем с этой?"
    ya "Мы все уже обсудили, я думал, ты поняла."
    show dv shy pioneer2 close at right with dissolve
    dv "Я тоже думала. Думала, что после всех слов я могла бы попробовать, если они правдивы."
    show zh normal pioneer glasses close at left with dspr
    mz "Ах вот где вы двое?"
    "Ох, Женя, и чего тебе в библиотеке не сиделось."
    mz "Я с самого утра жду, а вы тут вдвоем ходите значит."
    show zh angry pioneer glasses close at left with dspr
    show dv angry pioneer2 close at right with dspr
    dv "Да, а тебе завидно?"
    mz "Нисколько. Мне наоборот все предельно ясно."
    "Они обе были так сердиты, что я боялся вставить даже короткого слова."
    "Могло ли со мной произойти что-то более дурацкое."
    "Да, если бы Женя объявилась на минуту раньше и увидела все то, чего вообще не должно было случиться."
    "И пока рыжая не проговорилась об этом, надо было срочно заканчивать этот спор."
    ya "Успокойтесь, я просто хотел объяснить Алисе, чтобы не было проблем в будущем."
    mz "Нечего вообще с ней говорить, от нее сплошные проблемы."
    dv "Да, он много чего мне сказал и были там такие вещи, которых ты за всю свою жизнь не услышишь, коротышка."
    dv "И вообще нам вместе было хорошо пока ты не влезла."
    mz "Ах так? Тогда счастливо оставаться."
    dv "Да и нам будет хорошо, так хорошо как с тобой бы никогда не было."
    ya "А ну-ка замолчи женщина!"
    ya "Я клянусь богом, что хотел сделать все, чтобы никто не ушел обиженным, но это уже абсурд какой-то!"
    ya "Алиса, мы с тобой все обсудили, ничего у нас не было и не будет. Так понятно?"
    show dv sad pioneer2 close with dspr
    ya "Женя, я объясню тебе это позже. Дождись меня в библиотеке и не смей никуда уходить!"
    mz "Ничего обещать не могу."
    hide zh with dissolve
    ya "И что это сейчас было?"
    dv "Ну а что? Ты сам сказал, что если бы ее не было, то мы..."
    ya "Не воспринимай мои слова слишком буквально. И вообще я не ожидал, что ты можешь так поступить со своим другом."
    dv "Прости."
    hide dv with dissolve
    "Бросив неискренние извинения, она тут же убежала."
    "Вот же ситуация..."
    "И правда. Не делай добра - не получишь зла."
    "Только, что теперь говорить об этом. Я ведь сам виноват."
    "Стоило поставить Женю в известность и только потом идти к Алисе, а теперь непонятно что из этого получится."
    stop ambience fadeout 1
    play ambience ambience_dining_hall_full fadein 1
    scene bg int_dining_hall_people_day with dissolve
    play sound sfx_open_door_1
    "Обедал я с особым аппетитом."
    "Пропущенный завтрак давал о себе знать."
    "Мысли в голове никак не хотели ложиться на свои места."
    "Женя, судя по всему, серьезно расстроилась."
    "Хватит ли мне слов на этот раз, чтобы убедить ее в собственной невиновности?"
    stop ambience fadeout 1
    play ambience ambience_library_day fadein 1
    scene bg int_library_day with dissolve
    play sound sfx_open_door_1
    "К счастью, Женя была на месте."
    "Завидев меня, она отложила книгу на стол и быстро подошла ко мне."
    show zh normal pioneer glasses close at center
    mz "Пришел. Я думала к этой пойдешь."
    ya "Извини, Женя."
    ya "Снова не подумал и все получилось..."
    ya "Сама видишь как."
    show zh angry pioneer glasses close at center
    mz "Что вы там с ней выясняли?"
    ya "Вчера она была обижена на меня."
    ya "Я хотел уладить дело миром, чтобы никто из-за меня не страдал."
    mz "Поглядите, какой чувственный нашелся."
    mz "И давно ты всех утешать принялся?"
    ya "В первую нашу встречу я мог бы сказать что-то обидное в ответ на твои слова и чем бы дело кончилось?"
    show zh normal pioneer glasses close at center
    mz "Чем?"
    ya "А ничем хорошим. Я бы точно не смог так хорошо узнать тебя. Даже не представлял бы тебя настоящую."
    ya "Мы бы не провели столько прекрасных часов. Не смогли бы насладиться этими приятными вечерами. Мой мир без тебя был бы пустым и блеклым."
    show zh shyangry pioneer glasses close at center
    mz "Ну хватит тебе."
    ya "Я в какой-то момент понял, что сам не хочу обижать кого-то и в последнюю очередь тебя. Каждый из вас - прекрасный человек, а ты еще и так дорога моему сердцу."
    show zh shy pioneer glasses close at center
    mz "Перестань."
    ya "Мне стоило предупредить тебя о том, что я собираюсь к Алисе. Не хотел лишний раз тревожить тебя, но вон как получилось."
    mz "Ладно, не обижаюсь."
    ya "Отлично. Какие планы на сегодня?"
    show zh fun pioneer glasses close at center
    mz "Даже не знаю. Дела всякие..."
    ya "Могу уйти и навестить вечером, если ты занята."
    mz "А ты хочешь уйти?"
    ya "Честно? Нет."
    mz "Можешь остаться в таком случае, но без дела сидеть не будешь."
    mz "Поможешь с уборкой."
    ya "Я же только недавно убирался?"
    show zh sceptic pioneer glasses close at center
    mz "Пару книг на полку уложить - это не уборка!"
    mz "Каждую книгу надо положить на свое место в разделе, все по алфавиту и в правильном номерном порядке."
    ya "Ишь, как серьезно."
    show zh hope pioneer glasses close at center
    mz "А ты думал. С этим все строго."
    ya "Готов приступать, товарищ заведующая."
    mz "Начнешь с левой стороны, я с правой, встретимся посередине."
    scene bg polki with dspr
    "Дело выдалось утомительным."
    "Не уверен, что тут наводили порядок с начала смены."
    "Даже при небольшом потоке читателей потрудиться пришлось солидно."
    "Но пару часов спустя мы и правда встретились где-то посередине."
    show zh normal pioneer glasses close at center with dissolve
    ya "Вроде и полок немного, а работы навалилось вагон и маленькая тележка."
    mz "Это священная обязанность работника библиотеки. Нечего жаловаться."
    ya "Я тут даже не работаю. Невольный труд."
    mz "Это в капиталистических странах есть невольный труд. У нас же лишь добровольная рабоче-крестьянская солидарность."
    mz "Ты должен радоваться, что служишь благородному делу народного просвещения."
    ya "Я бы лучше чаю попил или вроде того. Сдался мне этот ваш народ."
    show zh bukal pioneer glasses close at center
    mz "Что за речи такие антисоветские?"
    ya "Давно хотел спросить. Чем тебе так советский строй нравится?"
    mz "Тем, что это справедливое государство для рабочих, отрицающее наемный и рабский труд. Где каждый старается ради общего блага."
    ya "Ага, мир, дружба и коммунизм. Счастье всем даром."
    mz "Ничего подобного. А тебе не мешало бы книжки на эту тему почитать. И научиться трактовать сложные вещи не так буквально."
    ya "Я читал. Революция, красные набежали и все такое."
    show zh rage pioneer glasses close at center
    mz "Дать бы тебе по голове за такие речи антисоветские."
    mz "А революция - локомотив истории."
    "Ага, так разогнал, что до сих пор отойти не можем."
    ya "Спорить не буду."
    ya "Ты явно лучше знаешь об этом, но будущее у всех этих идей крайне туманно."
    mz "Можно подумать, ты знаешь как все будет."
    "Хотелось рассказать, но я сразу отбросил эту идею."
    "В лучшем случае не поверит."
    "Да и что я ей расскажу о будущем?"
    "Что ее любимый совок отошел в мир иной, а на руинах красной империи мы начали худо бедно выживать?"
    "Изменилось не слишком многое. Интернет, западные товары появились, еще эти придурки на электросамокатах по улицам гоняют. Вот и все значимые отличия."
    "Пусть лучше десяток лет еще поживет в блаженном неведении."
    "С верой в большую и объединяющую всех идею. Ведь после нее уже ничего подобного никогда не будет."
    show zh normal pioneer glasses close at center with dspr
    mz "Молчишь? Вот и правильно. Нечего глупости говорить."
    ya "Может, теперь чаю?"
    mz "Хунте антисоветской чай не положено пить."
    ya "Жаль, а я надеялся."
    mz "И совершенно зря."
    ya "Могу ли я хоть вечер украсть у такой занятой девушки?"
    show zh shy pioneer glasses close at center
    mz "Посмотрим, что скажет об этом моя переменчивая натура."
    ya "Договорились. Я загляну после ужина."
    stop ambience fadeout 1
    scene bg ext_library_day
    play sound sfx_open_door_1
    play ambience ambience_day_countryside_ambience fadein 1
    "Ладно, должен признать, что не такая уж она и непредсказуемая, а очень даже рассудительная девушка."
    "Иногда грубая и нетерпеливая, но это даже придает ей некоторое особое очарование."
    "Я чувствовал себя отлично."
    "Наконец, все проблемы были решены и я снова мог без страха смотреть в будущее, строить планы на ближайший вечер."
    scene bg ext_square_day with dissolve
    "До ужина еще было время и мне надо было себя как-то занять."
    "Алису лучше не тревожить, Мику слишком гиперактивная для меня, а с остальными как-то и общих тем для беседы не было."
    "Даже не знаю куда пойти."
    show pi close at center with dissolve
    pi "Ты начинаешь меня разочаровывать."
    ya "А ты перестань ходить вокруг да около и объясни понятно что здесь происходит. Может быть, тогда я прислушаюсь к твоим словам."
    pi "Я уже давно за тобой наблюдаю. Ты слишком упрям, чтобы поверить в мои слова."
    ya "Попробуй."
    pi "Ты совсем не был удивлен тому, что тут происходит? Ты ничего не помнишь, но точно знаешь что тебе делать. Как это возможно? Подумай."
    ya "Может, хватит этой загадочности? Я даже не хочу спрашивать кто ты такой и что тебе от меня нужно."
    pi "Ты здесь уже был. Вспомни. Тогда поймешь и остальное."
    ya "Я никогда здесь не был, это невозможно."
    pi "У меня еще много времени, чего нельзя сказать о тебе. Вспоминай, пока ты еще можешь."
    hide pi with dissolve
    "Ну вот, опять пропал."
    "И что же он просит вспомнить."
    "Я точно не мог быть здесь раньше. Я родился уже после всего, что тут происходит. Я никогда не был тут даже в своем времени."
    "Это звучит как бред, да и сам этот пионер не внушал доверия. Но зачем ему все эти тайны?"
    stop ambience fadeout 1
    play ambience ambience_dining_hall_full fadein 1
    scene bg int_dining_hall_with_people_sunset with dissolve
    "Время ужина."
    "Я задумчиво и неспешно запихивал еду в рот."
    "Старался напрячь все извилины своего мозга, чтобы вспомнить что-то связанное с лагерем из своего прошлого."
    "Если не с лагерем, то кем-то из его обитателей, но как я не пытался, ничего не получилось."
    "Это казалось какой-то бессмыслицей."
    "Почему я вообще обязан играть в его дурацкие игры?"
    "В следующий раз надо выяснить. Перехвать инициативу и узнать все, что мне нужно."
    "А сейчас не время нагружать голову, пора возвращаться к Жене."
    stop ambience fadeout 1
    play sound sfx_open_door_1
    play ambience ambience_library_day fadein 1
    scene bg int_library_night2 with dissolve
    $ persistent.sprite_time = "night"
    ya "Женя, ты здесь?"
    mz "Библиотека закрывается. Для кого расписание написано? Читать не умеете? Нечего вам тогда в библиотеке делать!"
    "Из глубины полок доносились уже ставшие родными возмущенные крики Жени."
    show zh fun pioneer glasses close at center with dissolve
    mz "Ой, это ты. Не узнала сразу."
    ya "Как на счет еще одной вечерней прогулки?"
    mz "Только если не очень долгой. Куда на этот раз?"
    ya "Туда, где нас не достанет ни единая живая душа."
    show zh sceptic pioneer glasses close at center
    mz "Куда же? В старый лагерь?"
    ya "А там никого?"
    mz "Из живых точно."
    ya "А из мертвых?"
    mz "Никого там нету, просто старый корпус лагеря."
    ya "Даже призраков не водится?"
    mz "Вообще никого. И хватит антинаучную ерунду говорить."
    mz "Возьми фонарик, там достаточно темно."
    "Женя протянула мне солидного размера ручной фонарь."
    ya "Откуда знаешь? Ходила уже ночами?"
    show zh angry pioneer glasses close at center
    mz "Ночью в лесу темно!"
    mz "Не задавай глупых вопросов."
    ya "Ладно, тогда идем."
    "Женя взяла с собой какую-то книгу перед тем, как отправиться в путь."
    stop ambience fadeout 1
    play ambience ambience_forest_night fadein 1
    scene bg lesnight
    "Я не знал дороги, так что Женя приняла на себя обязанность указывать путь."
    "Мы шли по лесной тропинке к старому лагерю."
    "Хотя я и не знал куда именно и как долго придется идти."
    "Не хотелось портить момент и задавать глупые вопросы."
    "В конце концов, я получал огромное удовольствие даже от простых молчаливых прогулок с ней."
    with vpunch
    play music vetki
    "В одно мгновенье ее рука выскользнула из моей."
    stop music
    "С громким хрустом веток девушка провалилась куда-то вниз, издавая протяжный крик."
    ya "Женя ты в порядке?"
    "Крикнул я."
    "Мой голос расходился эхом куда-то в глубину ямы."
    mz "Да, все хорошо."
    mz "Тут какой-то тоннель, спускайся."
    ya "Да-да, сейчас."
    "Вдруг это уже не она, а нечто иное, жуткое говорит со мной ее голосом, зазывая под землю?"
    "До этого момента наше путешествие казалось мне забавным, теперь от былого азарта и следа не осталось."
    mz "Ну где ты там? Тут темно и холодно."
    "Я прижал фонарик подбородком к груди и аккуратно спустился вниз, оглядываясь."
    stop ambience fadeout 1
    scene bg tonnel with dspr
    play ambience ambience_old_camp_outside
    show zh normal pioneer glasses close at left with dspr
    "Опасения не оправдались."
    "Это действительно была Женя, а не кто-то говорящий ее голосом или этот кто-то принял ее облик, пока настоящую Женю уже объели до костей в какой-нибудь пещере неподалеку."
    mz "Доволен?"
    mz "Мы теперь непонятно где."
    ya "Рано паниковать, отсюда должен быть выход."
    "Да, у самого ноги дрожали, что я едва мог скрывать это, чтоб не показаться перед Женей трусом."
    "Она же держалась хорошо."
    stop ambience fadeout 2
    play ambience ambience_catacombs fadein 2
    scene bg fonar with dspr
    "Мы шли вперед, даже не знаю как и почему, но я снова поймал себя на мысли, что знаю куда идти."
    "Глазами я виел все эти тоннели и повороты первый раз в жизни, но ноги сами вели меня в верном направлении."
    "Заученный до автоматизма маршрут. Я бы и с закрытыми глазами мог выбраться отсюда, но как такое возможно?"
    "Женя лишь шла следом, не задавая вопросов, полностью полагаясь на мое чутье, даже не задавая вопросов."
    "Наконец, спустя десяток поворотов и извилистых проходов я ощутил дуновение ветра."
    "Верный признак того, что мы на пути к выходу."
    scene bg luk with dissolve
    "Мы добрались до лестницы, через решетку люка которой пробивался лунный свет."
    "Я, недолго думая, полез наверх."
    "Женя отправилась за мной."
    stop ambience fadeout 1
    play ambience ambience_ext_road_night fadein 1
    scene bg genda with dissolve
    show zh normal pioneer glasses close at center with dspr
    "Удивительно, но мы выбрались прямо под памятником на площади."
    ya "Эх, опять мы в лагере. А как же старый корпус?"
    mz "Да ну его."
    ya "Полностью поддерживаю. А что тогда? Расходиться не хочется."
    mz "Есть идеи?"
    ya "Одна имеется."
    "Я взял Женю за руку и повел за собой."
    stop ambience fadeout 1
    play ambience ambience_boat_station_night fadein 1
    scene bg zhbereg with dissolve2
    $ renpy.pause (2, hard = True)
    mz "Снова здесь."
    ya "Ведь отсюда все и началось. Три дня назад."
    mz "Даже не знаю почему я решила согласиться прийти в тот раз."
    ya "Не пожалела об этом?"
    mz "Еще успею."
    ya "Ладно тебе. Неужели, просто не желаешь насладиться моментом?"
    mz "Это непросто. Всегда думаю о будущем. О том, что ждет нас дальше, как изменится наша жизнь."
    mz "О том, что мы..."
    ya "Не надо. попробуй просто радоваться тому, что есть у тебя здесь и сейчас."
    mz "Трудно не думать о грядущем."
    mz "Впереди целая жизнь, такая загадочная, таинственная."
    mz "Нужно решить кем станешь, брать полную ответственность за свою судьбу."
    mz "А я..."
    mz "Честно сказать, даже не знаю чего хочу от жизни."
    ya "Понимаю тебя. Знала бы насколько хорошо."
    ya "Не знаю, что будет дальше, но я рад, что ты сейчас со мной."
    mz "И я."
    $ renpy.pause (5, hard = True)
    scene bg ext_boathouse_night
    show zh fun pioneer glasses close at left with dspr
    ya "Очередной прекрасный вечер."
    mz "Трудно не согласиться."
    ya "Проводить тебя?"
    mz "Не стоит. Не потеряюсь."
    ya "Уверена? Мне не трудно."
    mz "Все хорошо, просто немножко грустно от всего этого. Скоро конец смены и..."
    mz "Мне пора, до завтра."
    hide zh with dissolve
    "Я остался у воды еще ненадолго."
    "Старался не думать о грустном, но печаль напирала с огромной силой."
    "Надо идти спать, пока я целиком не окунулся в это."
    stop ambience fadeout 1
    play ambience ambience_ext_road_night
    scene bg ext_square_night with dissolve
    play music grusnopzdts fadein 1
    $ renpy.pause (5, hard = True)
    "На пути к домику я услышал приятную, но грустную мелодию, которая еще сильнее навеивала тоску."
    "Я остановился, чтобы немного послушать."
    "Затем мне стало интересно откуда доносится эта музыка."
    "Судя по всему, со сцены."
    "Конечно, откуда же еще."
    $ renpy.pause (5, hard = True)
    scene bg saddv1 with dissolve
    stop music fadeout (1)
    "Едва я добрался до сцены, музыка прекратилась."
    "Неподалеку от сцены стояла Алиса с печальным выражением лица."
    "Она меня не заметила, да я и не хотел лишний раз показываться ей на глаза."
    "Девушка положила гитару и пошла в сторону домиков."
    "Я выждал немного времени и отправился следом, стараясь не быть замеченным."
    scene bg saddv2
    "У домика ее встретила соседка Ульяна."
    us "Ну как там твой возлюбленный?"
    us "Все получилось?"
    dv "Может быть в другой раз."
    dv "А то и в другой жизни."
    dv "Пойдем спать, а?"
    us "Эх, неужели ничего интересного?"
    dv "Спать!"
    scene bg ext_houses_night with dissolve2
    $ renpy.pause (3.5, hard = True)
    "Вот и мне пора..."
    scene bg dom with dissolve
    $renpy.pause (2)
    show blink
    $renpy.pause (2)
    scene black
    th "Продолжение следует..."